Revit 2026 API

# ExportLayerTableRemove Method

---

Removes the pair (key, info) by pattern key.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void Remove(
	ExportLayerKey exportLayerKey
)
```
```vb
Public Sub Remove (
	exportLayerKey As ExportLayerKey
)
```
```cpp
public:
void Remove(
	ExportLayerKey^ exportLayerKey
)
```
```fsharp
member Remove :
        exportLayerKey : ExportLayerKey -> unit
```

#### Parameters

exportLayerKey ExportLayerKey
     The export pattern key.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

ExportLayerTable Class

Autodesk.Revit.DB Namespace